Revit 2027 API
Point.Create(XYZ) Method
 Creates a point at the given coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Point Create(
	XYZ coord
)
Public Shared Function Create (
	coord As XYZ
) As Point
public:
static Point^ Create(
	XYZ^ coord
)
static member Create :
        coord : XYZ -> Point
Parameters
coord XYZ
 The coordinates where the point will be created.
Return Value
Point
 A Point object.
See Also
Reference
Point Class
Create Overload
Autodesk.Revit.DB Namespace